Revit 2026 API

# DisplayingOptionsDialogEventArgs Class

---

The event arguments used by DisplayingOptionDialog event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPreEventArgs Autodesk.Revit.UI.EventsDisplayingOptionsDialogEventArgs

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DisplayingOptionsDialogEventArgs : RevitAPIPreEventArgs
```
```vb
Public Class DisplayingOptionsDialogEventArgs
	Inherits RevitAPIPreEventArgs
```
```cpp
public ref class DisplayingOptionsDialogEventArgs : public RevitAPIPreEventArgs
```
```fsharp
type DisplayingOptionsDialogEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
```

The DisplayingOptionsDialogEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | PagesCount | The count of pages in the options dialog (include the default pages added by Revit). |

|  | Name | Description |
| --- | --- | --- |
|  | AddTab | Add tab to option dialog with tab name and handler information. |
|  | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. (Inherited from RevitAPIPreEventArgs) |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI.Events Namespace